cask_args appdir: '/Applications'

# ================================================================
# tap
# ================================================================

tap 'sanemat/font'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

# ================================================================
# formulas
# ================================================================

brew 'git'
brew 'zsh', args: ['disable-etc-dir']
brew 'zsh-completions'
brew 'vim', args: ['with-lua']
brew 'tmux'

brew 'gcc'
brew 'go'
brew 'lua'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'

brew 'jq'
brew 'gnu-sed'
brew 'curl'
brew 'tree'
brew 'peco'

brew 'hub'
brew 'ghq'
brew 'tig'

brew 'heroku-toolbelt'
brew 'imagemagick'
brew 'pngquant'

brew 'chromedriver'

brew 'mas'

brew 'ricty', args: ['vim-powerline']

# ================================================================
# mas
# ================================================================

mas 'The Unarchiver', id: 425424353
mas 'YoruFukurou',    id: 428834068
mas 'Xcode',          id: 497799835
mas 'LINE',           id: 539883307
mas 'Slack',          id: 803453959
mas 'Sync',           id: 1076860635

# ================================================================
# cask
# ================================================================

cask 'google-chrome'
cask 'firefoxdeveloperedition-ja'

cask 'java'

cask 'android-file-transfer'
cask 'appcleaner'
cask 'alfred2'
cask 'bettertouchtool'
cask 'caffeine'
cask 'dash'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'karabiner'

cask 'silverlight'
cask 'flash-player'

cask 'aquaterm'
cask 'mactex'
# cask 'pandoc'
cask 'skim'
cask 'xquartz'

cask 'adobe-illustrator-cc-ja'
cask 'adobe-creative-cloud'
cask 'sketch'
cask 'zeplin'

cask 'android-studio'
cask 'arduino'
cask 'pycharm'
cask 'sublime-text'

cask 'vagrant'
cask 'postgres'

cask 'github-desktop'
cask 'kindle'
cask 'licecap'
cask 'skype'

cask 'font-fontawesome'
cask 'font-material-icons'
cask 'font-inconsolata'
cask 'font-m-plus'
cask 'font-rounded-m-plus'
cask 'font-noto-sans-cjk-jp'
cask 'font-raleway'
# cask 'font-raleway-dots'
#
# cask 'java'
cask 'font-ricty-diminished'

# after mactex
# brew 'gnuplot', args: ['with-x', 'latex']
