cask_args appdir: '/Applications'

# ================================================================
# tap
# ================================================================

tap 'caskroom/cask'
tap 'caskroom/versions'

# ================================================================
# formulas
# ================================================================

brew 'git'
brew 'git-lfs'
brew 'zsh', args: ['disable-etc-dir']
brew 'zsh-completions'
brew 'vim', args: ['with-lua', 'with-override-system-vi']
brew 'tmux'
brew 'reattach-to-user-namespace'

brew 'hub'
brew 'ghq'
brew 'tig'

brew 'gcc'
brew 'go'
brew 'lua'
brew 'nodenv'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'readline'

brew 'docker'
brew 'docker-compose'
brew 'docker-machine'

brew 'mongodb'
brew 'mysql'

brew 'jq'
brew 'gnu-sed'
brew 'curl'
brew 'tree'
brew 'peco'
brew 'coreutils'

brew 'nkf'

brew 'heroku-toolbelt'
brew 'imagemagick'
brew 'pngquant'

brew 'chromedriver'

brew 'mas'

# ================================================================
# mas
# ================================================================

mas 'The Unarchiver', id: 425424353
mas 'YoruFukurou',    id: 428834068
mas 'LadioCast',      id: 425424353
mas 'LINE',           id: 539883307
mas 'Slack',          id: 803453959

# ================================================================
# cask
# ================================================================

cask 'google-chrome'
cask 'firefox', args: { 'language': 'ja' }

cask 'android-file-transfer'
cask 'appcleaner'
cask 'alfred2'
cask 'bettertouchtool'
cask 'caffeine'
cask 'dash'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'karabiner'
cask 'cmd-eikana'

cask 'silverlight'
cask 'flash-player'

cask 'mactex'
cask 'xquartz'

cask 'adobe-acrobat-reader'
cask 'adobe-creative-cloud'
cask 'sketch'
cask 'zeplin'

cask 'android-studio'
cask 'arduino'
cask 'pycharm'
cask 'sublime-text'

cask 'vagrant'
cask 'postgres'

cask 'kindle'
cask 'licecap'
cask 'skype'
cask 'discord'

# after mactex
brew 'gnuplot', args: ['with-x11', 'latex']
